#include <iostream>

using namespace std;

int main()
{
    int n[5][5] = {{1, 2, 3}, 
                    {4, 5, 6},
                    {7, 8, 9}};
    // 这种初始化方式没有提到的元素全部为零
    // 数组名是数组元素的首地址，因此二维数组名是指向二维数组中第一个行数组的指针
    
    cout << n[0][0] << endl; //1
    cout << n[2][3] << endl; //0
    cout << n[4][4] << endl; //0

    cout << "-------------------" << endl;

    // 运算符优先级：圆括号 > 方括号 > 取内容运算符/取地址运算符

    // 这一组依次向后偏移20字节
    cout << n << endl; //二维数组名是指向二维数组中第一个行数组的指针，即指向指针的指针
    cout << n[0] << endl; //对指针取下标运算要从指针所指向内容的整体进行编号再取内容，即第一个行数组
    // 所以看似上面两行输出的内容一样，但含义却完全不同，22行输出的是指向指针的指针，23行输出的是指针
    cout << n + 1 << endl;
    cout << (n + 1)[0] << endl;

    cout << "-------------------" << endl;

    cout << *n << endl; //二维数组中的第一个行数组，也是指针，指向第一个行数组中的第一个元素
    cout << *n[0] << endl; //因为n[0]是第一个行数组，所以*n[0]是第一个行数组中的第一个元素
    cout << *(n + 1) << endl;
    cout << *(n + 1)[0] << endl;

    cout << "-------------------" << endl;

    cout << &n[0] << endl;
    cout << &n[0][0] << endl;
    cout << &n[0] + 1 << endl; //对指针进行加减运算要根据指针所指向元素的整体进行地址偏移
    cout << &n[0][0] + 1 << endl;

    cout << "-------------------" << endl;

    // 注意&n[0]是指向第一个行数组的指针，因此&n[0] + 1要向后偏移20字节
    // &n[0] + 1作为指向行数组的指针(即指向指针的指针)，使用下标索引时
    // [0]表示当前指向的行数组的地址，[1]表示下一个行数组的地址
    // 对于指向数组的指针来说，使用下标索引相当于一次对指针取内容
    cout << (&n[0] + 1)[0] << endl;
    cout << *((&n[0] + 1)[0]) << endl;
    cout << *(&n[0] + 1)[0] << endl;

    cout << (&n[0] + 1)[1] << endl;
    cout << *((&n[0] + 1)[1]) << endl;
    cout << *(&n[0] + 1)[1] << endl;

    cout << "-------------------" << endl;

    cout << (&n[0] + 1) + 1 << endl;
    cout << *((&n[0] + 1) + 1) << endl; //上一行的输出内容是指向指针的指针，因此要经过两次取内容才可以得到具体元素
    cout << **((&n[0] + 1) + 1) << endl;
    cout << &n[0] + 2 << endl;
    cout << *(&n[0] + 2) << endl;
    cout << **(&n[0] + 2) << endl;

    cout << "-------------------" << endl;

    cout << *(&n[0] + 1)[0] << endl;
    cout << *(&n[0] + 1)[1] << endl;
    cout << *(&n[1])[1] << endl;
    cout << *(&n)[1] << endl; //这里的&n是指向整个二维数组的指针，因此*(&n)[1]相比&n向后偏移100字节
    cout << *(&n[0])[1] << endl;
    cout << n[2][0] << endl;

    return 0;
}